01.Lab Work/10.Day 10(2026.01.05)/CA/07.LB06/Example02/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:tns="http://example.com/wsdl/HelloService">
   <soap:Body>
      <tns:sayHello>
         <firstName>John</firstName>
      </tns:sayHello>
   </soap:Body>
</soap:Envelope>